import React from 'react';

class PersonalDataProcessing extends React.Component {

    render() {
        return(
            <div className="content">
                <div className="inner_news_container">
                    <h1>Згода на обробку персональних даних</h1>
                    <pre className="news_text">
                        <p>
                            Надаючи свої дані для реєстрації та продовжуючи використовувати даний сайт, я надаю свою добровільну,
                            конкретну, інформовану і свідому згоду Профейсійній спілці «Аеронавігація» (79040, м. Львів, вул. Любінська,
                            217, а/с3983, Львівський РСП Украероруху тел. +38-032-297-21-16) (далі – «Профспілка») на обробку моїх
                            наступних персональних даних, що збираються через сайт http://airnavigation.lviv.ua (далі – «Сайт»):
                            <br/>
                            <br/>
                            відомості, що збираються в автоматичному режимі (дата і час відвідування Сайту, поновлення та видалення
                            або знищення даних, відомості про дії на Сайті (в т.ч. використання сервісів Сайту), файли «cookies»),
                            в т.ч. з використанням метричних програм (систем) Google Analytics, Google Tag Manager,
                            <br/>
                            <br/>
                            відповідно до умов обробки, викладених у цієї згоді.
                        </p>
                        <h2>Дії з персональними даними та способи обробки.</h2>
                        <p>
                            Ця згода дається на вчинення наступних дій (операцій) або сукупності дій (операцій): збирання, реєстрація,
                            накопичення, зберігання, адаптування, зміна, поновлення, використання, знеособлення, знищення персональних
                            даних, в тому числі з використанням інформаційних (автоматизованих) систем, включаючи шляхом внесення в
                            інформаційні системи персональних даних Профспілки.
                        </p>
                        <h2>Цілі</h2>
                        <p>
                            Обробка моїх персональних даних на підставі цієї згоди може здійснюватися Профспылкою з метою:
                        </p>
                        <ul>
                            <li>поліпшення роботи Сайту, підвищення зручності та ефективності моєї роботи з Сайтом,</li>
                            <li>надання рішень і послуг, які найбільш відповідають моїм потребам,</li>
                            <li>надання цільової інформації щодо рішень і послуг Профспылкт,</li>
                            <li>забезпечення технічної можливості функціонування Сайту.</li>
                        </ul>
                        <h2>Треті особи.</h2>
                        <p>
                            Профспілка не передає персональні дані третім особом, в тому числі і рекламним компаніям. Профспілка не використовує рекламу на Сайті.
                        </p>
                        <h2>Термін дії.</h2>
                        <p>
                            Ця згода діє з моменту її надання і протягом всього періоду використання мною Сайту до моменту
                            відкликання цієї згоди. Протягом даного терміну Профспілка, інші зазначені в згоді особи мають право
                            обробляти, в тому числі зберігати, мої персональні дані, зазначені в цій згоді.
                        </p>
                        <p>
                            Порядок відкликання згоди. Мені відомо, що ця згода в будь-який момент може бути мною відкликана шляхом
                            направлення в Профспілку письмового повідомлення про відкликання, спрямованого рекомендованим листом або
                            переданого особисто за адресою: Профейсійна спілка «Аеронавігація» (79040, м. Львів, вул. Любінська,
                            217, а/с3983, Львівський РСП Украероруху тел. +38 032 297-21-16).
                            Відкликання цієї згоди вступає в силу з дати вручення відповідного повідомлення Компанії.
                        </p>
                        <p>
                            У разі відкликання згоди на обробку персональних даних я поінформований(а) про необхідність припинити
                            використання Сайту або, в разі відкликання згоди тільки щодо обробки файлів «cookies», відмови від обробки
                            персональних даних метричними програмами (Google Analytics, Google Tag Manager та інших), я поінформований(а)
                            про необхідність відключити файли «cookies» в налаштуваннях мого браузера.
                        </p>
                        <p>
                            Місцезнаходження моїх персональних даних (фактична адреса обробки персональних даних): 79040, м. Львів,
                            вул. Любінська, 217.
                        </p>
                        <h2>Права суб'єкта:</h2>
                        <p>
                            Я до моменту надання цієї згоди ознайомлений зі своїми правами, передбаченими Законом України № 2297-VI від
                            01.06.2010 «Про захист персональних даних» (далі – «Закон»), а саме:
                        </p>
                        <ul>
                            <li>знати про джерела збирання, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження
                                та / або місце проживання (перебування) володільця чи розпорядника персональних даних або дати відповідне
                                доручення щодо отримання цієї інформації уповноваженим мною особам, крім випадків, встановлених Законом;
                            </li>
                            <li>
                                отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх осіб,
                                яким передаються мої персональні дані;
                            </li>
                            <li>
                                на доступ до своїх персональних даних;
                            </li>
                            <li>
                                отримувати не пізніше як за 30 календарних днів з дня надходження запиту, крім випадків, передбачених законом,
                                відповідь про те, чи обробляються мої персональні дані, а також отримувати зміст таких персональних даних;
                            </li>
                            <li>
                                пред’являти володільцю персональних даних вмотивовану вимогу із запереченням проти обробки своїх персональних
                                даних;
                            </li>
                            <li>
                                пред’являти вмотивовану вимогу щодо зміни або знищення своїх персональних даних будь-яким володільцем
                                та розпорядником персональних даних, якщо ці дані обробляються незаконно чи є недостовірними;
                            </li>
                            <li>
                                на захист своїх персональних даних від незаконної обробки та випадкових втрат, знищення, пошкодження
                                у зв’язку з умисним приховуванням, ненаданням або несвоєчасним їх наданням, а також на захист від надання
                                відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;
                            </li>
                            <li>
                                звертатися із скаргами на обробку своїх персональних даних до органів державної влади, до Уповноваженого
                                Верховної Ради України з прав людини та посадових осіб або до суду;
                            </li>
                            <li>
                                застосовувати засоби правового захисту у разі порушення законодавства про захист персональних даних;
                            </li>
                            <li>
                                вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;
                            </li>
                            <li>
                                відкликати згоду на обробку персональних даних;
                            </li>
                            <li>
                                знати механізм автоматичної обробки персональних даних;
                            </li>
                            <li>
                                на захист від автоматизованого рішення, яке має для мені правові наслідки.
                            </li>
                        </ul>
                        <p>
                            Цим я також підтверджую, що до надання даної згоди (в момент збору персональних даних) я ознайомлений з:
                        </p>
                        <ul>
                            <li>
                                правами, наданими мені відповідно до чинного законодавства про персональні дані,
                            </li>
                            <li>
                                інформацією про джерела збирання, місцезнаходження своїх персональних даних, місцезнаходження
                                або місце проживання володільця та розпорядників персональних даних, склад та зміст зібраних
                                персональних даних, мету збору та обробки моїх персональних даних та осіб, яким передаються
                                персональні дані, мети і підстави такої передачі, які дії з персональними даними передбачає
                                їх обробка, термін зберігання, умови відкликання згоди, а також з іншою інформацією в простій
                                та зрозумілій формі, що дозволяє мені дати інформовану, добровільну та свідому згоду на обробку
                                моїх персональних даних.
                            </li>
                        </ul>
                    </pre>
                </div>
            </div>
        );
    }
}
export default PersonalDataProcessing;